#
#
# # def generate_regex(text8):
# #     # 去除特殊字符
# #     text8 = re.escape(text8)
# #     # 替换数值部分为\\d+，匹配多个数字
# #     text8 = re.sub(r'\d+', r'\\d+', text8)
# #     # 替换空格为\\s+
# #     text8 = re.sub(r' ', r'\\s+', text8)
# #     # 替换冒号为:
# #     text8 = re.sub(r':', r':', text8)
# #     return text8
# # def remove_source(text,text8):
# #     result = re.sub(text8, "", text)
# #     return result
#
# from crazy import *
#
# text = """
#
#
# 2016-12-20 11:08:22 来源：
# 1.属于国家一类保护动物的是——天鹅,
# 2.举重时运动员为什么搓白粉——吸取手上的汗，成分：碳酸镁,
# 3.非洲国家边界按什么划分的最多——经线或纬线,
# 4.举重比赛的级别是按——按体重划分,
# 5.仓储超市与其它超市最大的不同点是——储售场地合一,
# 6.18 世纪德国贵族热衷于收集并定制各种树木做的“木头书 ”，以木头做成的盒子，盒面 用树皮制作，盒子里面都 用来装——树叶、果实等,
# 7.鸵鸟受到惊吓或敌害时可能会——将头低垂到与地面平行，羽毛竖起,
# 8.最早制造香水瓶所用的原料是——石膏(公元前 4000 年古埃及人),
# 9.持有哪种“伤残证书 ”可在乘坐火车时享受购票减价待遇——革命伤残军人证,
# 10.最早的四冲程内燃机(吸气冲程、压缩冲程、做功冲程、排气冲程)用的是什么燃料—— 煤气,
# 11.下面哪一种熨烫衣服的方法是不正确的?->尽可能长时间地熨,
# 12.冻疮是由于皮肤哪一部分受损而引起的?->毛细血管,
# 13.1978 年 10 月国家标准局制定颁布的 5 吨以上集装箱标准有： (多选)->30 吨,20 吨,10 吨,5 吨,
# 14.世界上最大的宫殿是：->故宫,
# 15.我国曲艺中的相声是：->北方曲种,
# 16.世界上最靠北的首都是：->雷克亚未克,
# 17.反映波兰作曲家肖邦生平的美国影片是：->《一曲难忘》,
# 18.除法律另有规定或合同另有约定外，保险合同成立后，谁有权解除合同?->投保人,
# 19.国际奥委会为感谢萨马兰奇对奥林匹克运动的贡献，发行了一枚名为《感谢主席先生》 的： ->纪念封,
# 20.古代女子成年行什么礼?->笄礼,
#
# 21.给折枝山茶花保鲜应该用什么?->淡盐水, 樟脑丸的主要成分是：->萘, 22.《义勇军进行曲》聂耳同谁所作的抗日歌曲?->田漢、聂耳 ,
# 23.下列行星中哪两个行星没有自己的天然卫星?(多选)->金星,水星,
# 24.声音在哪里传播更快?->水中,
# 25.农历把每月初一叫做什么日?->朔日,
# 26.铁锅通常用哪种铁制成?->生铁, 消防队救火：->不收费,
# 27.文学史上魔幻现实主义流派的代表人物是：->马尔克斯,
# 28.戛纳电影节在哪国举办?->法国,
# 29.烤全羊烤的是：->绵羊,
# 30.哪种病人不宜饮茶?->溃疡病,
# 31.音乐界所说的大小施特劳斯：->是父子关系,
# 32.仰韶文化是我国历史上哪个时代中期的文化?->新石器,
# 33.刮痧是我国民间传统的简易治疗方法，对吗?->对,
# 34.小儿生长发育最快的时期是：->婴儿期,
# 35.感光胶片中的全色片是一种：->黑白感光片,
# 36.传统彩瓷“素三彩 ”之所以称“素 ”是因不用：->红色,
# 37.“龙井茶叶，虎跑水 ”。虎跑泉的水很有趣，装满一杯水后，轻轻地放进一粒小石子，
#
#
#
#
#
# 水就会高出杯面，可是它却不溢出来，好象覆盖着一个无形的杯盖。泉水为什么不溢出来? -> 泉水比纯水的表面张力大,
# 38.绿色服装应具备哪些特点?(多选)->不褪色,获得 ”环境标志,不含铅,不含汞, 39.蒙古首都乌兰巴托的意思是：->红色英雄,
# 40.债券与股票的区别是什么?->债券风险小、收益稳定、股票风险大、收益高,
#
# 41.火腿中有“南腿 ”之称的是：->金华火腿,
# 42.房地产开发企业应在商品房交付之日起多少天内递交办理产权证资料?->100 天, 43."六一居士 ”是谁的别号?->欧阳修,
# 44."隔着门缝看人 ”时，看到的人：->和原来一样,
# 45.影响电视图象的主要污染因素是->电磁辐射污染,
# 46.一个细胞一小时分裂三个，9 小时可以把一个容器装满，多少时间使分裂的细胞装到容 器的 1/9。->7 小时,
# 47.一般来说，在发生通货膨胀时，靠固定工资生活的人：->生活水平会下降,
# 48.有记录的世界上飞翔距离最远的是什么鸟?->北极燕鸥,
# 49.乘坐两排轮子的大型客车，坐在哪里最颠簸 ?->车顶,
# 50.俗称的“黑管 ”是哪种木管乐器?->单簧管,
# 51.世界上最长的山脉是：->安第斯山,
# 52.《福尔摩斯探案集》里的“苏格兰场 ”在：->英国,
# 53.以下哪些果实是核果?->樱桃,
# 54.热带鱼一般生活在：->淡水中,
# 55.猫在哪个国家内受到严格保护?->古埃及,
# 56.《本草纲目》的作者是->李时珍,
# 57.人的唾液是舌头分泌的，对吗?->错,
# 58.苏伊士运河属于哪个国家?->埃及,
# 59.世界上第一辆摩托车其主要材料是：->木头,
# 60.亚硝胺是食品中致癌的因素，但是可以多吃什么来抑制人体对亚硝胺的吸收和合成?-> 大白菜,
#
# 61.“ 山外青山楼外楼 ”在原诗《题临安邸》中的下句是：->西湖歌舞几时休,
# 62.中国最热的地方在哪里?->吐鲁番盆地,
# 63.水在摄氏多少度时密度最大?->4 度,
# 64.太阳系中最大的行星是 : ->木星,
# 65.居住在蒙古与内蒙古地区的民族联合，并自称“蒙古 ”，起于何时?->成吉思汗, 66.“腊八粥 ”最早起源于：->佛教,
# 67.委托人所确定的拍卖标的的保留价是成交的最高价吗?->不是,
# 68.中国古建筑学科的开拓者是：->梁思成,
# 69.杜鹃鸟不做窝，她把蛋下到其他鸟的鸟巢里对吗?->对,
# 70.亚欧大陆桥欧洲的终点站是：->鹿特丹,
# 71.空手道的禁忌是：->出击触及对方身体,
# 72.按照公司法规定，股份有限公司发起人的股份在公司设立几年内不能转让?->3 年, 73.举重比赛中，最重的杠铃片是：->红色的,
# 74.我国是什么时候采用公历的?->建国前夕, “驸马 ”最初是指：->官名,
# 75.古希腊哪个国家的儿童一出世就要受到严格挑选，体质弱的会被抛之荒野?->斯巴达,
#
#
#
#
#
# 76.纯羊绒的含绒量在：->95%以上,
# 77.中国古代哪个学派的主张，与绿色和平组织的思想相近?->道家,
# 78.西游记中去西天取经的“唐三藏 ”的真名是：->玄奘,
# 79.血液中的红细胞可以活：->120 天,
# 80.国际通用的航海速度用“节 ”表示，一“节 ”为：->1.852 公里/小时,
#
# 81.电池上通常标有 R55、R5、等符号，R 代表：->电池的形状,
# 82.在下列哪一年 Internet 网延伸入中国?->94 年,
# 83.金星上会看到“旭日西升 ”吗?->对,
# 84.冬季奥运会如何计算届次?->4 年 1 次，以实际举办次数计算,
# 85.下列天体中，距离地球最近的恒星是：->太阳,
# 86.地球公转速度为每秒：->30 公里,
# 87.几个人以上共同故意犯罪被称为共同犯罪。->2 个,
# 88.世界名画《和平鸽》的创作者是->毕加索,
# 89.《春秋》是按什么记事的?->年, 奥运五环旗中的绿色环代表：->澳洲,
# 90.用微波炉煮荷包蛋时要用牙签在蛋清、蛋黄上扎孔主要是为了什么?->防止爆裂, 91.“歌棚 ”是哪个民族的习俗?->壮族,
# 92.正规围棋比赛的棋盘大小是：->19 乘 19,
# 93.景泰蓝的表层用金丝,彩釉装饰,用什么做胎?->铜,
# 94.有“钢琴诗人 ”之称的是：->肖邦, “总角之交 ”是指：->少年之交,  95.通常情况下，中秋节晚上的月亮总是比第二天晚上的月亮亮吗?->不是,
# 96.茶叶的含水量高于 8%会导致什么后果?->发生霉变,
# 97.马头琴是我国哪一民族的拉弦乐器?->蒙古族,
# 98.五子棋段位制最高为：->九段, 下面哪种炊具对人体健康最有益?->铁锅,
# 99.在劳动合同中写有“发生工伤事故责任自负 ”的条款，是否具有法律效力?->没有,
# 100.郭沫若的诗集是：->《女神》, 我国古代称生什么为“弄瓦 ”?->女孩, 常识 40000 问（二）
# 2016-11-18 17:03:34 来源：
# 101.按有关法律规定，经营者可以从事的抽奖式有奖销售，最高奖的奖金额的限度是：-> 五千元人民币,
# 102.水族姑娘出嫁后要完成的第一件事是：->挑水,
# 103.英语“文化 ”一词原意是指：->耕作,
# 104.我们日常的主食基本上属于什么食物?->酸性食物,
# 105.小儿没爬就会走了，好吗?->不好,
# 106.下列哪种人最适宜坚持慢跑?->心脏病,
# 107.可以用厚纸做容器来把水烧开吗?->可以,
# 108.太阳光经三棱镜折射后，形成色带，将温度计的水银泡涂黑，放到光带上，从紫端向红 端移动，温度计指示的温度将不断：->升高,
# 109.蕴藏石油最丰富的半岛是：->阿拉伯半岛,
# 110.受委托代理销售房屋的房地产中介机构除有工商执照外还应有：->资质证书, 111.下列战役中，被陈毅元帅称作“人民群众用小车推出来的 ”是：->淮海战役,
# 112.公元前 594 年，实行“初税亩 ”，按亩收税的国家是：->鲁国,
# 113.最耐日晒的织品是哪一种?->腈纶,
# 114.古语“朵颐 ”中的“颐 ”是指：->面颊,
#
#
#
#
#
# 115."华表 ”又叫做 ->表木,
# 116.蝴蝶发现花蜜靠：->前足沾,
# 117.破产企业甲曾与乙企业共同出资合办一法人企业丙，则甲出资投入丙的财产：->应作为 破产财产,
# 118.冬泳时，在下水之前饮用白酒可以御寒吗?->不可以,
# 119.走私、贩卖、运输、制造多少克毒品是犯罪行为?->无论数量多少,
# 120.电度表上的一度电表示耗电量为：->1 千瓦*小时,
#
# 121.汉字“廿 ”是表示：->二十,
# 122.国际奥林匹克集邮联合会在哪一国家成立?->瑞士,
# 123.欧洲第一个使用印刷机的民族是：->冰岛人,
# 124."一狐之腋 ”比喻：->珍贵的事物,
# 125."户枢不蠹 ”的“不蠹 ”是什么意思?->不生虫,
# 126.中国虽然不是双姓大国，但还是有不少双姓，请问以下哪个不是双姓?->三台,
# 127.行驶在支路的轿车 A 未让行驶在干路的轿车 B 导致两车在路口相撞，则：->轿车 A 负全 部责任,
# 128.照相机不能拍摄到人眼看不到的星星吗?->不对,
# 129.防风林要达到最好的防风效果，应由：->10 行以上树组成,
# 130.空腹跑步有利健康吗?->不利,
# 131.《阿里山的姑娘》是哪个少数民族的家人?->高山族民歌,
# 132.南岳衡山的最高峰是：->祝融峰,
# 133.以下哪一位曾被称为“药王 ”? ->孙思邈,
# 134.我国的“诗圣 ”指的是：->杜甫,
# 135.以下哪一作法不利于新生儿更多地看到玩具?->把玩具悬挂在孩子头的正上方, 136，樱桃白兰地是用樱桃作原料酿制的，对不对?->对,
# 137.小明把一个中央有圆孔的铜垫片加热，他发现中央的圆孔->变大,
# 138.青蛙除了用肺外还用什么器官呼吸?->皮肤,
# 139.否决权最初的语义是：->我禁止,
# 140.钻石最大的产出国是：->扎伊尔,
#
# 141.第一次鸦片战争发生的时间是：->1840 年 6 月,
# 142，按国家规定，机关新录用的本科毕业生，在试用期基本月工资为：->330 元, 143.西方国家所称的“毕达哥拉斯定理 ”，在中国则被称做：->勾股定理,
# 144.下列不适用《产品质量法》的有：->建设工程,
# 145.清洁的空气中含有多少氧?->21%,
# 146.20 公里以上的竞走比赛，一般每隔多少公里设置饮食供给站?->5 公里,
# 147.以下哪一个是联合国安理会常任理事国之一?->法国,
# 148.世界上生产玉米最多的国家是：->美国,
# 149.世界最早的公用电话亭是在：->电话公司内,
# 150.发生在北京卢沟桥的历史事变名叫?->七七事变,
# 151.歌剧《茶花女》谁的作品?->威尔第,
# 152 世界上第一家麻将博物馆坐落在：->日本,
# 153.蜜蜂中的“蜂王 ”是：->雌蜂,
# 154.《史记》是：->纪传体通史,
#
#
#
#
#
# 155.馒头是谁发明的?->诸葛亮,
# 156.预防颈椎病，下列哪种方法是错误的?->睡软床,
# 157 起诉虐待案件应是什么部门受理：->人民法院,
# 158.隋唐时期的官制中尚书省分为吏,户,礼,兵,刑,工六部,其中的礼部是掌管：->掌管国家 的典章法度,祭祀,学校,科举和接待四方宾客等事务,
# 159.我国宪法的监督权属于：->全国人大常委会,
# 160.长颈鹿的颈椎数和狗的颈椎数目一样多吗?->一样,
#
# 161.唐代诗人朱庆馀的“妆罢低声问夫婿 ”，问的是：->张籍,
# 162.报道中有时会看到关于“UFO ”的报道，UFO 是指不明飞行物，对吗?->对, 163.我们在电塔附近听到的嗡鸣声是：->电线发出的,
# 164.根据宪法规定，土地使用权可以依据法律的规定：->转让,
# 165.我国的“冰城 ”是指哪一城市?->哈尔滨,
# 166，在苹果树修剪合理的情况下，果实着色最好的部位应处于->树南侧上方, 167. 自行车的红色尾灯只是个装饰品吗?->不是,
# 168.古诗云：洞庭天下水，岳阳天下楼。岳阳楼在哪座湖上?->洞庭湖,
# 169.下列影片中，以歌颂少数民族新生活为题材的是：->《达吉和她的父亲》, 170.“三明治 ”的命名与什么活动有关?->打牌,
# 171.下面的通讯社哪个属于美国?->美联社,
# 172.搪瓷器皿是否越重越好?->不是,
# 173.辣椒在植物分类中，是属于->茄科,
# 174.美术作品<<开国大典>> 是一幅：->油画,
# 175.下列蔬菜中富含铁质营养的是：->菠菜,
# 176.电鳗是一种鳗鱼吗?->不是,
# 177.世界最深的洼地是：->死海,
# 178.泥娃娃“大阿福 ”的老家是：->江苏无锡,
# 179.人走路时摆动双臂主要是为了：->平衡走路姿势,
# 180.鲨鱼用什么呼吸?->鳃,
#
# 181.在江浙一带最流行的地方戏曲是：->越剧,
# 182.下列京剧剧目不属于"三国戏"的是：->《宇宙锋》,
# 183.婴儿出生时啼哭意味着婴儿开始有：->呼吸,
# 184.在地球上，极光是高纬度地区特有的景观，对不对?->对,
# 185.被称为“三苏 ”的北宋文学家父子中的父亲是 ->苏洵,
# 186.少年韩寒中学肄业却出了一本叫做《三重门》的书，这本书的体裁是：->小说,
# 187.科举中，会出现一人兼解元、会元、状元的“连中三元 ”，其分别是在什么考试中取得 的?->乡试、会试、殿试,
# 188.韭菜是一种什么类型的植物?->多年生草本,
# 189.世界上目前产量最大、应用最广泛的电池是：->锌锰干电池,
# 190.我国最著名的热水湖是哪一个?->西藏羊八井,
# 191.新加坡经济发展较快的主要原因是：->地理位置优越,
# 192.最早设计的轮椅有几个轮子?->三个,
# 193.骆驼有双层眼睫毛。->对,
# 194.象征主义诗歌的开山鼻祖是->艾略特,
# """
# text1 = '2016-12-20 11:08:22 来源：'
# print(remove_source(text,text1))
from crazy import *

